
Процедура ПройденТестАдминистрированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
    Результат = ПройденТестАдминистрирование;
	
КонецПроцедуры

Процедура ПройденТестПрограммированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
    Результат = ПройденТестПрограммирования;
	
КонецПроцедуры

Процедура ВакансияОператорПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
    ПредложеннаяВакансия = Перечисления.Вакансии.Оператор1С;
	
КонецПроцедуры

Процедура ВакансияАдминистраторПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
     ПредложеннаяВакансия = Перечисления.Вакансии.Администратор1С;
	
КонецПроцедуры

Процедура ВакансияПрограммистПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
    ПредложеннаяВакансия = Перечисления.Вакансии.Программист1С;
	
КонецПроцедуры
